#+TITLE: Knative

* Accessing services
#+begin_src shell
kn service list -A
#+end_src

#+RESULTS:
#+begin_example
NAMESPACE   NAME    URL                                             LATEST        AGE   CONDITIONS   READY   REASON
test        nginx   https://nginx.test.bobymcbobs.pair.sharing.io   nginx-00001   17m   3 OK / 3     True
#+end_example

** Components
#+begin_src shell
kubectl -n knative-serving get deployment
#+end_src

#+RESULTS:
#+begin_example
NAME                         READY   UP-TO-DATE   AVAILABLE   AGE
activator                    1/1     1            1           48m
autoscaler                   1/1     1            1           48m
autoscaler-hpa               1/1     1            1           48m
controller                   1/1     1            1           48m
domain-mapping               1/1     1            1           48m
domainmapping-webhook        1/1     1            1           48m
net-certmanager-controller   1/1     1            1           48m
net-certmanager-webhook      1/1     1            1           48m
net-contour-controller       1/1     1            1           48m
webhook                      1/1     1            1           48m
#+end_example

#+begin_notes
Activator: listens for endpoints hit and scales up revision deployments
#+end_notes

** Configuration
#+begin_src shell
kubectl -n knative-serving get cm
#+end_src

#+RESULTS:
#+begin_example
NAME                     DATA   AGE
config-autoscaler        1      59m
config-certmanager       2      59m
config-contour           1      59m
config-defaults          2      59m
config-deployment        2      59m
config-domain            2      59m
config-features          1      59m
config-gc                1      59m
config-leader-election   1      59m
config-logging           1      59m
config-network           5      59m
config-observability     1      59m
config-tracing           1      59m
kube-root-ca.crt         1      59m
#+end_example

#+begin_notes
Since we're using Knative-Operator we don't modify the configuration this way, but checking them out is useful for observing the exact config
#+end_notes

* Set up :noexport:
Link up this folder to the web
#+begin_src shell :results silent
rm ~/public_html
ln -s $PWD ~/public_html
#+end_src

Generate a token
#+begin_src shell
curl -s ${MULTIPLEX_URL:-reveal-multiplex.glitch.me}/token | jq .
#+end_src

#+RESULTS:
#+begin_example
{
  "secret": "16303595814587938032",
  "socketId": "1ea00b34ec29b2a6"
}
#+end_example
